Revit 2026 API

# CurveLoopsProfileProfile Property

---

Returns the curve loops of the profile.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveArrArray Profile { get; set; }
```
```vb
Public Property Profile As CurveArrArray
	Get
	Set
```
```cpp
public:
property CurveArrArray^ Profile {
	CurveArrArray^ get ();
	void set (CurveArrArray^ value);
}
```
```fsharp
member Profile : CurveArrArray with get, set
```

#### Property Value

CurveArrArray

This property is used to retrieve the curve loops of profile.

#### Reference

CurveLoopsProfile Class

Autodesk.Revit.DB Namespace